Repository: MartinZikmund/gc-toolbox
Catalog: src/GcToolkit/Strings/*/Resources.resw
Source language: en
Languages: cs

# SignalFlagsMeaningV
source: I require assistance.
cs: Potřebuji pomoc.

# SignalFlagsMeaningW
source: I require medical assistance.
cs: Potřebuji lékařskou pomoc.

# SignalFlagsMeaningX
source: Stop carrying out your intentions and watch for my signals.
cs: Zastavte provádění svých záměrů a sledujte moje signály.

# SignalFlagsMeaningY
source: I am dragging my anchor.
cs: Vleče se mi kotva.

# SignalFlagsMeaningZ
source: I require a tug.
cs: Potřebuji remorkér.

# SignalFlagsMeaningAnswer
source: Acknowledges a signal; also serves as the decimal point.
cs: Potvrzuje přijetí signálu; slouží také jako desetinná čárka.

# SignalFlagsMeaningSubstitute1
source: Repeats the first flag of the hoist.
cs: Opakuje první vlajku signálu.

# SignalFlagsMeaningSubstitute2
source: Repeats the second flag of the hoist.
cs: Opakuje druhou vlajku signálu.

# SignalFlagsMeaningSubstitute3
source: Repeats the third flag of the hoist.
cs: Opakuje třetí vlajku signálu.

# TextReverse_Name
source: Reverse text
cs: Obrácení textu

# TextReverse_Tooltip
source: Reverse, shuffle or flip text — by string, line, word or character.
cs: Obraťte, zamíchejte nebo otočte text — po řetězci, řádku, slově či znaku.

# TextReverseMode
source: Mode
cs: Režim

# TextReverseModeText
source: Reverse text
cs: Obrátit text

# TextReverseModeTextPerLine
source: Reverse text per line
cs: Obrátit text po řádcích

# TextReverseModeWordOrder
source: Reverse word order
cs: Obrátit pořadí slov

# TextReverseModeWordOrderPerLine
source: Reverse word order per line
cs: Obrátit pořadí slov po řádcích

# TextReverseModeCharsPerWord
source: Reverse character order per word
cs: Obrátit pořadí znaků v každém slově

# TextReverseModeRandomPerWord
source: Random character order per word
cs: Náhodné pořadí znaků v každém slově

# TextReverseModeUpsideDown
source: Text upside down
cs: Text vzhůru nohama

# TextReverseModifiers
source: Modifiers
cs: Úpravy

# TextReverseKeepCaseLocation
source: Keep upper case location
cs: Zachovat pozice velkých písmen

# TextReverseKeepFirstLast
source: Keep the first and last character
cs: Zachovat první a poslední znak

# TextReverseSwapCase
source: Change upper and lower case
cs: Prohodit velká a malá písmena

# TextReverseToUpper
source: Convert to upper case
cs: Převést na velká písmena

# TextReverseToLower
source: Convert to lower case
cs: Převést na malá písmena

# TextReverseRemoveUnknown
source: Remove unknown characters
cs: Odebrat neznámé znaky

# TextReverseReverseUpsideDown
source: Reverse text (reads right way up when flipped)
cs: Obrátit text (čitelný po otočení vzhůru nohama)

# TextReverseInputLabel
source: Input
cs: Vstup

# TextReverseInputPlaceholder
source: Type text to reverse, shuffle or flip…
cs: Zadejte text k obrácení, zamíchání nebo otočení…

# TextReverseOutputLabel
source: Result
cs: Výsledek

# TextReverseClear
source: Clear
cs: Vymazat

# TextReverseCopy
source: Copy
cs: Kopírovat

# TextReverseShare
source: Share
cs: Sdílet

# TextReverseReroll
source: Shuffle again
cs: Zamíchat znovu

# GcCodeId_Name
source: GC code ↔ ID
cs: GC kód ↔ ID

# GcCodeId_Tooltip
source: Convert a public GC code (e.g. GC16XYD) to and from its internal numeric ID.
cs: Převeďte veřejný GC kód (např. GC16XYD) na interní číselné ID a zpět.

# GcCodeIdDirection
source: Direction
cs: Směr

# GcCodeIdDirectionAuto
source: Auto-detect
cs: Automaticky

# GcCodeIdDirectionCodeToId
source: GC code → ID
cs: GC kód → ID

# GcCodeIdDirectionIdToCode
source: ID → GC code
cs: ID → GC kód

# GcCodeIdInputLabel
source: Input
cs: Vstup

# GcCodeIdInputPlaceholder
source: Enter a GC code or ID — separate several with commas, spaces or new lines…
cs: Zadejte GC kód nebo ID — více hodnot oddělte čárkami, mezerami nebo novými řádky…

# GcCodeIdClear
source: Clear
cs: Vymazat

# GcCodeIdResultLabel
source: Result
cs: Výsledek

# GcCodeIdBatchLabel
source: Results
cs: Výsledky

# GcCodeIdCopyRow
source: Copy this result
cs: Kopírovat tento výsledek

# GcCodeIdInvalidNote
source: Some values could not be converted and are shown as “?”.
cs: Některé hodnoty nelze převést a jsou zobrazeny jako „?“.

# GcCodeIdCopy
source: Copy
cs: Kopírovat

# GcCodeIdCopyAll
source: Copy all (CSV)
cs: Kopírovat vše (CSV)

# GcCodeIdShare
source: Share
cs: Sdílet

# GcCodeIdHowItWorksHeader
source: How it works
cs: Jak to funguje

# GcCodeIdHowItWorksBody
source: Each cache has a public code (GC…) and an internal numeric ID. Codes up to GCFFFF are simple hexadecimal (GCFFFF = 65535). From GCG000 onward the code is a base-31 number over the characters 0-9 and A-Z without the ambiguous I, L, O, S and U, with a fixed offset applied. The “GC” prefix is optional and input is case-insensitive.
cs: Každá keš má veřejný kód (GC…) a interní číselné ID. Kódy do GCFFFF jsou jednoduchá šestnáctková čísla (GCFFFF = 65535). Od GCG000 výše je kód číslo o základu 31 nad znaky 0-9 a A-Z bez nejednoznačných I, L, O, S a U, s pevným posunem. Předpona „GC“ je nepovinná a na velikosti písmen nezáleží.

# AngleConversion_Name
source: Angle conversion
cs: Převod úhlů

# AngleConversion_Tooltip
source: Convert an angle between degrees, radians, gradians, mils, turns, compass points and more.
cs: Převeďte úhel mezi stupni, radiány, gradiány, dílky, otáčkami, kompasovými body a dalšími jednotkami.

# AngleUnit_Degrees
source: Degrees (°)
cs: Stupně (°)

# AngleUnit_Radians
source: Radians (rad)
cs: Radiány (rad)

# AngleUnit_Gradians
source: Gradians (grad, gon)
cs: Gradiány (grad, gon)

# AngleUnit_MilsNato
source: Mils NATO (1/6400)
cs: Dílky NATO (1/6400)

# AngleUnit_MilsMilliradian
source: Mils / milliradian (1/(2000·π))
cs: Dílky / miliradián (1/(2000·π))

# AngleUnit_MilsSoviet
source: Mils Soviet (1/6000)
cs: Dílky sovětské (1/6000)

# AngleUnit_MilsSweden
source: Mils Sweden (1/6300)
cs: Dílky švédské (1/6300)

# AngleUnit_Turns
source: Turns
cs: Otáčky

# AngleUnit_Points
source: Points (compass)
cs: Kompasové body

# AngleUnit_HourAngles
source: Hour angles
cs: Hodinové úhly

# AngleUnit_Arcminutes
source: Arcminutes (′)
cs: Úhlové minuty (′)

# AngleUnit_Arcseconds
source: Arcseconds (″)
cs: Úhlové sekundy (″)

# AngleInputLabel
source: Angle
cs: Úhel

# AngleInputPlaceholder
source: e.g. 45, 45.5, 45,5 or 45°30'15"…
cs: např. 45, 45.5, 45,5 nebo 45°30'15"…

# AngleFromLabel
source: From
cs: Z

# AngleToLabel
source: To
cs: Na

# AngleSwap
source: Swap units
cs: Prohodit jednotky

# AngleDecimalsLabel
source: Decimal places
cs: Počet desetinných míst

# AngleResultLabel
source: Result
cs: Výsledek

# AngleInvalidNotice
source: Enter a valid angle — a number, or degrees in D°M'S" form.
cs: Zadejte platný úhel — číslo nebo stupně ve tvaru D°M'S".

# AngleClear
source: Clear
cs: Vymazat

# AngleCopy
source: Copy
cs: Kopírovat

# AngleShare
source: Share
cs: Sdílet

# AngleAllUnitsLabel
source: All units
cs: Všechny jednotky

# AngleCopyUnit
source: Copy this value
cs: Kopírovat tuto hodnotu

# ColourConversion_Name
source: Colour conversion
cs: Převod barev

# ColourConversion_Tooltip
source: Convert a colour between hex, RGB, CMY, CMYK, HSL, HSV, HSI, YIQ, YUV and YCbCr.
cs: Převádějte barvu mezi hex, RGB, CMY, CMYK, HSL, HSV, HSI, YIQ, YUV a YCbCr.

# ColourConversionIntro
source: Colours can be written in many notations. Type a value into any model and every other model updates instantly.
cs: Barvy lze zapsat mnoha způsoby. Zadejte hodnotu do libovolného modelu a všechny ostatní modely se ihned přepočítají.

# ColourConversionPreview
source: Preview
cs: Náhled

# ColourConversionDeviceNote
source: Some conversions (for example CMYK → RGB) are not standardised and are device-specific in real colour-management systems, so results may differ between devices.
cs: Některé převody (například CMYK → RGB) nejsou standardizované a v reálných systémech správy barev závisí na zařízení, takže výsledky se mohou mezi zařízeními lišit.

# ColourConversionCopyHex
source: Copy hex
cs: Kopírovat hex

# ColourConversionCopyAll
source: Copy all
cs: Kopírovat vše

# ColourConversionShare
source: Share
cs: Sdílet

# ColourConversionHexLabel
source: Hexadecimal
cs: Šestnáctkový

# ColourConversionR
source: Red
cs: Červená

# ColourConversionG
source: Green
cs: Zelená

# ColourConversionB
source: Blue
cs: Modrá

# ColourConversionCyan
source: Cyan
cs: Azurová

# ColourConversionMagenta
source: Magenta
cs: Purpurová

# ColourConversionYellow
source: Yellow
cs: Žlutá

# ColourConversionKey
source: Key (black)
cs: Klíčová (černá)

# ColourConversionHue
source: Hue
cs: Odstín

# ColourConversionSaturation
source: Saturation
cs: Sytost

# ColourConversionLightness
source: Lightness
cs: Světlost

# ColourConversionBrightness
source: Brightness
cs: Jas

# ColourConversionIntensity
source: Intensity
cs: Intenzita

# ColourConversionLuma
source: Luma (Y)
cs: Jas (Y)

# BrainfuckOok_Name
source: Brainfuck & Ook!
cs: Brainfuck a Ook!

# BrainfuckOok_Tooltip
source: Run, generate and transliterate Brainfuck and its Ook! variants.
cs: Spusťte, vygenerujte a převádějte Brainfuck a jeho varianty Ook!.

# BrainfuckOokModeLabel
source: Mode
cs: Režim

# BrainfuckOokModeExecute
source: Run code → text
cs: Spustit kód → text

# BrainfuckOokModeEncode
source: Text → code
cs: Text → kód

# BrainfuckOokModeConvert
source: Convert notation
cs: Převést notaci

# BrainfuckOokNotationLabel
source: Notation
cs: Notace

# BrainfuckOokTargetNotationLabel
source: To notation
cs: Na notaci

# BrainfuckOokNotationOokShort
source: Ook! short
cs: Ook! krátká

# BrainfuckOokInputLabel
source: Code
cs: Kód

# BrainfuckOokInputPlaceholder
source: Paste a program to run, or type text to encode…
cs: Vložte program ke spuštění nebo napište text k zakódování…

# BrainfuckOokStdinLabel
source: Input (stdin)
cs: Vstup (stdin)

# BrainfuckOokStdinPlaceholder
source: Bytes fed to the "," command…
cs: Bajty předané příkazu „,“…

# BrainfuckOokClear
source: Clear
cs: Vymazat

# BrainfuckOokOutputLabel
source: Result
cs: Výsledek

# BrainfuckOokCopy
source: Copy
cs: Kopírovat

# BrainfuckOokShare
source: Share
cs: Sdílet

# BrainfuckOokAbortedMessage
source: The program was stopped: it ran too long or produced too much output (possible infinite loop).
cs: Program byl zastaven: běžel příliš dlouho nebo vytvořil příliš mnoho výstupu (možná nekonečná smyčka).

# BrainfuckOokAboutTitle
source: About Brainfuck & Ook!
cs: O jazyce Brainfuck a Ook!

# BrainfuckOokAboutBody
source: Brainfuck is a minimalist language of eight commands (> < + - . , [ ]) operating on a byte-cell tape. Ook! and Ook! short are exact rewrites of the same commands. Run a program to see its output, generate a program that prints your text, or convert freely between the three notations. Loops that never end are stopped automatically.
cs: Brainfuck je minimalistický jazyk osmi příkazů (> < + - . , [ ]) pracujících s páskou bajtových buněk. Ook! a Ook! krátká jsou přesné přepisy stejných příkazů. Spusťte program a uvidíte jeho výstup, vygenerujte program vypisující váš text nebo libovolně převádějte mezi třemi notacemi. Smyčky, které nikdy neskončí, se automaticky zastaví.

# SpellingAlphabet_Name
source: Spelling alphabet
cs: Hláskovací abeceda

# SpellingAlphabet_Tooltip
source: Spell text in NATO phonetic code words (and ten historical variants) — and read them back.
cs: Vyhláskuje text pomocí kódových slov NATO (a deseti historických variant) — a přečte je zpět.

# SpellingAlphabetVariantLabel
source: Alphabet
cs: Abeceda

# SpellingAlphabetVariant_Nato
source: NATO / ICAO (international)
cs: NATO / ICAO (mezinárodní)

# SpellingAlphabetVariant_Itu1932
source: ITU 1932 (international)
cs: ITU 1932 (mezinárodní)

# SpellingAlphabetVariant_AbleBaker
source: US Joint Army/Navy (Able Baker)
cs: Armáda/námořnictvo USA (Able Baker)

# SpellingAlphabetVariant_Apco
source: APCO / Police
cs: APCO / policie

# SpellingAlphabetVariant_Dutch
source: Dutch
cs: Nizozemská

# SpellingAlphabetVariant_German
source: German
cs: Německá

# SpellingAlphabetVariant_Swedish
source: Swedish
cs: Švédská

# SpellingAlphabetVariant_RussianOfficial
source: Russian (official)
cs: Ruská (oficiální)

# SpellingAlphabetVariant_RussianUnofficial
source: Russian (unofficial)
cs: Ruská (neoficiální)

# SpellingAlphabetEncode
source: Text to code words
cs: Text na kódová slova

# SpellingAlphabetDecode
source: Code words to text
cs: Kódová slova na text

# SpellingAlphabetAutoDetect
source: Auto-detect
cs: Automaticky

# SpellingAlphabetInputLabel
source: Input
cs: Vstup

# SpellingAlphabetInputPlaceholder
source: Type text, or paste code words to read back
cs: Zadejte text nebo vložte kódová slova k přečtení

# SpellingAlphabetClear
source: Clear
cs: Vymazat

# SpellingAlphabetSwap
source: Swap
cs: Prohodit

# SpellingAlphabetShowAllVariants
source: Show all alphabets
cs: Zobrazit všechny abecedy

# SpellingAlphabetOutputLabel
source: Result
cs: Výsledek

# SpellingAlphabetUnknownNotice
source: Unrecognised code words: {0}
cs: Nerozpoznaná kódová slova: {0}

# SpellingAlphabetCopy
source: Copy
cs: Kopírovat

# SpellingAlphabetShare
source: Share
cs: Sdílet

# SpellingAlphabetAllVariantsLabel
source: Every alphabet
cs: Všechny abecedy

# SpellingAlphabetChartTitle
source: Code-word chart
cs: Přehled kódových slov

# SpellingAlphabetChartHint
source: Tap a letter to add it to the input.
cs: Klepnutím na písmeno jej přidáte do vstupu.

# Pi_Tooltip
source: Look up decimals of π — first N digits, digits by position, ranges, and digit-sequence search.
cs: Vyhledávání desetinných číslic čísla π — prvních N číslic, číslice podle pozice, rozsahy a hledání posloupností.

# PiModeFirst
source: First N decimals
cs: Prvních N číslic

# PiModeDigitAt
source: Digit at position
cs: Číslice na pozici

# PiModeRange
source: Range of positions
cs: Rozsah pozic

# PiModeSearch
source: Find a sequence
cs: Hledání posloupnosti

# PiCountLabel
source: Number of decimals (1–1,000,000)
cs: Počet desetinných číslic (1–1 000 000)

# PiPositionLabel
source: Position (1–1,000,000)
cs: Pozice (1–1 000 000)

# PiFromLabel
source: From position
cs: Od pozice

# PiToLabel
source: To position (inclusive)
cs: Do pozice (včetně)

# PiSearchLabel
source: Digit sequence
cs: Posloupnost číslic

# PiSearchPlaceholder
source: e.g. 1415
cs: např. 1415

# PiPositionNote
source: Position 1 is the first digit after the decimal point.
cs: Pozice 1 je první číslice za desetinnou čárkou.

# PiShow
source: Show
cs: Zobrazit

# PiGroupDigits
source: Group digits in blocks of 10
cs: Seskupit číslice do bloků po 10

# PiLineNumbers
source: Show positions at line starts
cs: Zobrazit pozice na začátku řádků

# PiResultLabel
source: Result
cs: Výsledek

# PiContextLabel
source: In context
cs: V kontextu

# PiCopy
source: Copy
cs: Kopírovat

# PiShare
source: Share
cs: Sdílet

# PiDigitAtSummary
source: Decimal of π at position {0}
cs: Desetinná číslice π na pozici {0}

# PiFoundSummary
source: Occurrences found: {0}
cs: Nalezeno výskytů: {0}

# PiFoundTruncated
source: Occurrences found: {0} (showing the first {1} positions)
cs: Nalezeno výskytů: {0} (zobrazeno prvních {1} pozic)

# PiNoOccurrences
source: The sequence does not occur in the first 1,000,000 decimals of π.
cs: Posloupnost se v prvním milionu desetinných číslic π nevyskytuje.

# PiErrorCount
source: Enter a number of decimals between 1 and 1,000,000.
cs: Zadejte počet desetinných číslic od 1 do 1 000 000.

# PiErrorPosition
source: Enter a position between 1 and 1,000,000.
cs: Zadejte pozici od 1 do 1 000 000.

# PiErrorRange
source: Enter a valid range between 1 and 1,000,000 (from ≤ to).
cs: Zadejte platný rozsah od 1 do 1 000 000 (od ≤ do).

# PiErrorPattern
source: Enter a sequence of 1 to 50 digits.
cs: Zadejte posloupnost 1 až 50 číslic.

# PrimeNumbers_Name
source: Prime numbers
cs: Prvočísla

# PrimeNumbers_Tooltip
source: Test primality, find the n-th prime, a prime's position, the nearest prime, and prime factorizations.
cs: Test prvočíselnosti, n-té prvočíslo, pořadí prvočísla, nejbližší prvočíslo a rozklad na prvočísla.

# PrimeModeLabel
source: Function
cs: Funkce

# PrimeModePrimality
source: Primality test
cs: Test prvočíselnosti

# PrimeModeNthPrime
source: N-th prime
cs: N-té prvočíslo

# PrimeModePosition
source: Position of a prime
cs: Pořadí prvočísla

# PrimeModeNearest
source: Nearest prime
cs: Nejbližší prvočíslo

# PrimeModeFactorization
source: Prime factorization
cs: Rozklad na prvočísla

# PrimeInputLabel
source: Input
cs: Vstup

# PrimeInputPlaceholder
source: Enter a whole number…
cs: Zadejte celé číslo…

# PrimeRangeHint
source: Valid range: {0} – {1}
cs: Platný rozsah: {0} – {1}

# PrimeClear
source: Clear
cs: Vymazat

# PrimeResultLabel
source: Result
cs: Výsledek

# PrimeCopy
source: Copy
cs: Kopírovat

# PrimeShare
source: Share
cs: Sdílet

# PrimeInvalidNumber
source: Enter a whole number.
cs: Zadejte celé číslo.

# PrimeOutOfRange
source: Enter a number between {0} and {1}.
cs: Zadejte číslo mezi {0} a {1}.

# PrimeIsPrime
source: {0} is a prime number.
cs: {0} je prvočíslo.

# PrimeIsNotPrime
source: {0} is not a prime number — it is divisible by {1}.
cs: {0} není prvočíslo — je dělitelné číslem {1}.

# PrimeIsNotPrimeSimple
source: {0} is not a prime number.
cs: {0} není prvočíslo.

# PrimeNthResult
source: Prime #{0} is {1}.
cs: {0}. prvočíslo je {1}.

# PrimePositionResult
source: {0} is prime #{1}.
cs: {0} je {1}. prvočíslo.

# PrimePositionNotPrime
source: {0} is not a prime number — there are {1} primes below it.
cs: {0} není prvočíslo — menších prvočísel je {1}.

# PrimeNearestResult
source: The nearest prime to {0} is {1}.
cs: Nejbližší prvočíslo k {0} je {1}.

# PrimeNearestSelf
source: {0} is itself a prime number.
cs: {0} je samo prvočíslo.

# PrimePrevious
source: Previous prime
cs: Předchozí prvočíslo

# PrimeNext
source: Next prime
cs: Následující prvočíslo

# PrimeFactorizationPrime
source: {0} is a prime number — it has no smaller factors.
cs: {0} je prvočíslo — nemá žádné menší činitele.

# PrimePreparing
source: Preparing the prime table…
cs: Připravuje se tabulka prvočísel…

# EulerNumber_Name
source: Euler's number (e)
cs: Eulerovo číslo (e)

# EulerNumber_Tooltip
source: Look up the decimals of e — the first N digits, a position, a range, or every occurrence of a sequence.
cs: Vyhledávání v desetinném rozvoji čísla e — prvních N číslic, pozice, rozsah nebo všechny výskyty sekvence.

# EulerMode
source: Show
cs: Zobrazit

# EulerModeFirst
source: First N decimals
cs: Prvních N desetinných míst

# EulerModePosition
source: Decimal at position
cs: Číslici na pozici

# EulerModeRange
source: Position range
cs: Rozsah pozic

# EulerModeSearch
source: Find sequence
cs: Hledat sekvenci

# EulerCountLabel
source: Number of decimals (1–1,000,000)
cs: Počet desetinných míst (1–1 000 000)

# EulerPositionLabel
source: Position (1–1,000,000)
cs: Pozice (1–1 000 000)

# EulerRangeFromLabel
source: From position
cs: Od pozice

# EulerRangeToLabel
source: Up to and including position
cs: Do pozice (včetně)

# EulerSearchLabel
source: Digit sequence
cs: Sekvence číslic

# EulerSearchPlaceholder
source: e.g. 1828
cs: např. 1828

# EulerGroupDigits
source: Group digits in blocks of 10
cs: Seskupit číslice do bloků po 10

# EulerShowPositions
source: Show line positions
cs: Zobrazit pozice řádků

# EulerOutputLabel
source: Result
cs: Výsledek

# EulerOccurrencesLabel
source: Occurrences
cs: Výskyty

# EulerCopy
source: Copy
cs: Kopírovat

# EulerShare
source: Share
cs: Sdílet

# EulerCopyPosition
source: Copy this position
cs: Kopírovat tuto pozici

# EulerCountError
source: Enter a number of decimals between 1 and 1,000,000.
cs: Zadejte počet desetinných míst od 1 do 1 000 000.

# EulerPositionError
source: Enter a position between 1 and 1,000,000.
cs: Zadejte pozici od 1 do 1 000 000.

# EulerRangeError
source: Enter a valid range between 1 and 1,000,000 (start before end).
cs: Zadejte platný rozsah od 1 do 1 000 000 (začátek před koncem).

# EulerSearchError
source: The search sequence may contain only the digits 0–9.
cs: Hledaná sekvence smí obsahovat pouze číslice 0–9.

# EulerLoadError
source: The digits of e could not be loaded.
cs: Číslice čísla e se nepodařilo načíst.

# EulerSearchNoMatch
source: The sequence does not occur in the first 1,000,000 decimals.
cs: Sekvence se v prvním 1 000 000 desetinných míst nevyskytuje.

# EulerSearchCount
source: Occurrences found: {0}
cs: Počet výskytů: {0}

# EulerSearchTruncated
source: Occurrences found: {0} (showing the first {1})
cs: Počet výskytů: {0} (zobrazeno prvních {1})

# EulerIntegerNote
source: Position 1 is the first digit after the decimal point — the integer part of e (2) is not counted.
cs: Pozice 1 je první číslice za desetinnou čárkou — celá část čísla e (2) se nepočítá.

# GoldenRatio_Name
source: Golden ratio (φ)
cs: Zlatý řez (φ)

# GoldenRatio_Tooltip
source: Look up the decimals of φ — first N digits, a digit at a position, a range, or a digit sequence.
cs: Vyhledávání desetinných míst čísla φ — prvních N číslic, číslice na pozici, rozsah pozic nebo posloupnost číslic.

# GoldenRatioModeFirst
source: First decimals
cs: První desetinná místa

# GoldenRatioModeDigitAt
source: Digit at position
cs: Číslice na pozici

# GoldenRatioModeRange
source: Position range
cs: Rozsah pozic

# GoldenRatioModeSearch
source: Find sequence
cs: Hledat posloupnost

# GoldenRatioCountLabel
source: Number of decimals (1–1,000,000)
cs: Počet desetinných míst (1–1 000 000)

# GoldenRatioPositionLabel
source: Position (1 = first decimal)
cs: Pozice (1 = první desetinné místo)

# GoldenRatioFromLabel
source: From position
cs: Od pozice

# GoldenRatioToLabel
source: To position
cs: Do pozice

# GoldenRatioSearchLabel
source: Digit sequence
cs: Posloupnost číslic

# GoldenRatioSearchPlaceholder
source: e.g. 2026
cs: např. 2026

# GoldenRatioGroupDigits
source: Group digits in blocks of 10
cs: Seskupit číslice do bloků po 10

# GoldenRatioLineNumbers
source: Label lines with digit positions
cs: Označit řádky pozicemi číslic

# GoldenRatioOutputLabel
source: Result
cs: Výsledek

# GoldenRatioCopy
source: Copy
cs: Kopírovat

# GoldenRatioShare
source: Share
cs: Sdílet

# GoldenRatioErrorCount
source: Enter a number of decimals between 1 and 1,000,000.
cs: Zadejte počet desetinných míst od 1 do 1 000 000.

# GoldenRatioErrorPosition
source: Enter a position between 1 and 1,000,000.
cs: Zadejte pozici od 1 do 1 000 000.

# GoldenRatioErrorRange
source: Enter a valid range within 1 to 1,000,000 (from ≤ to).
cs: Zadejte platný rozsah v mezích 1 až 1 000 000 (od ≤ do).

# GoldenRatioErrorSequence
source: Enter 1 to 100 digits (0–9).
cs: Zadejte 1 až 100 číslic (0–9).

# GoldenRatioDigitAtSummary
source: Decimal #{0} of φ is {1}.
cs: Desetinné místo č. {0} čísla φ je {1}.

# GoldenRatioRangeSummary
source: Decimals {0} to {1} of φ ({2} digits).
cs: Desetinná místa {0} až {1} čísla φ ({2} číslic).

# GoldenRatioSearchSummary
source: Occurrences in the first 1,000,000 decimals of φ: {0}.
cs: Počet výskytů v prvních 1 000 000 desetinných místech čísla φ: {0}.

# GoldenRatioSearchNone
source: The sequence does not occur in the first 1,000,000 decimals of φ.
cs: Posloupnost se v prvních 1 000 000 desetinných místech čísla φ nevyskytuje.

# GoldenRatioSearchTruncated
source: Showing the first {0} matches.
cs: Zobrazeno prvních {0} výskytů.

# GoldenRatioAboutNote
source: φ = (1+√5)/2 ≈ 1.6180339887… All lookups work offline over the first 1,000,000 decimals.
cs: φ = (1+√5)/2 ≈ 1,6180339887… Všechna vyhledávání pracují offline nad prvními 1 000 000 desetinnými místy.

# Fibonacci_Name
source: Fibonacci numbers
cs: Fibonacciho čísla
